"""

"""
import pandas as pd

data = {'姓名': ['张三', '李四', '王五', '赵六'],
        '性别': ['0', '1', '0', '1'],
        '籍贯': ['北京', '甘肃', '', '上海']}
df = pd.DataFrame(data)
print(df, end="\n\n")

print("\n------------1.replace单值替换----------------")
df = df.replace('', '不详')  # 将空白的地方替换成'不详'
print(df)

print("\n------------2.replace多值替换----------------")
df = df.replace(['不详', '甘肃'], ['兰州1', '兰州2'])  # 将'不详','甘肃'分别替换成'兰州1','兰州2'
print(df)

print("\n------------3.replace字典替换----------------")
df = df.replace({'1': '男', '0': '女'})  # 将所有'1'替换成'男',所有'0'替换成'女    `'
print(df)
