"""
一维数组的切片,和Python中的切片一样

多维数组的切片,相当于matlab里取矩阵的子矩阵
    arr[arg1,arg2] #如果arg1和arg有一个是单列或者单行,返回结果是一维数组;否则返回二维数组
        arg1:表示取哪些行
        arg2:表示取哪些列
"""

import numpy as np

print("----------------1.一维数组的切片---------------")
nda = np.arange(10)
print(nda)
print(nda[2])
print(nda[-1])
print(nda[1:4])

print("\n----------------2.多维数组的切片---------------")
nda2 = np.arange(16).reshape(4, 4)
print("原数组：\n", nda2)
"""
 [[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]]
"""
print("\n-------------2.1.取某一列全部元素--------------")
print("arr[:,1]: ", nda2[:, 1])  # [ 1  5  9 13]; 一维，在所有行中，第1列元素,和matlab一样
print("arr[:,(1,)]:\n", nda2[:, (1,)])  # 二维
"""
[[ 1]
 [ 5]
 [ 9]
 [13]]
"""
print("\n-------------2.2.取某一列部分元素-------------")
print("arr[1:3, 3]:", nda2[1:3, 1])  # [5 9]； 一维:第[1,3)行，第1列

print("\n-------------2.3.取某一行全部元素--------------")
print("nda[1]:", nda2[1])  # [ 4  5  6  7]

print("\n-------------2.4.取某一行部分元素-------------")
print("arr[0, 1:3] : ", nda2[1, 1:3])  # [5 6]; 第1行，第[1,3)列元素

print("\n-------------2.5.取某些行取某些列-------------")
print("nda[1:3, 1:3]= \n", nda2[1:3, 1:3])  # shape是(2, 2) 二维; [1,3)行，[1,3)取元素
"""
 [[ 5  6]
 [ 9 10]]
"""
print('nda2[1:3, (0, 2, 3)]：\n', nda2[1:3, (1, 3)])  # 二维;第[1,2)行,第1、3列的元素
"""
[[ 5  7]
 [ 9 11]]
"""
print("nda2[(1, 3), :][:, (1, 3)]\n", nda2[(1, 3), :][:, (1, 3)])  # 第1,3行，第1，3列
"""
[[ 5  7]
 [13 15]]
"""

print("\n-------------3.1 取特定位置的一个元素-------------")
print(nda2[1][3])  # 7
print(nda2[1, 3])  # 7

print("\n-------------3.2 取特定位置的多个元素-------------")
print('nda2[(0, 1), (1, 3)]：', nda2[(1, 3), (1, 3)])  # [ 5 15] 一维 ;取第0行第1个元素，第1行第三个元素
print("nda2[(0, 1), (1, 3)]：", nda2[[1, 3], [1, 3]])  # [ 5 15]

print("\n-------------4.使用bool数组取元素-------------")
nda_bool = np.array([1, 1, 0, 0], dtype=np.bool)  # [ True False  True False] 布尔数组
print("\nnp.arange(nda_bool.size)[nda_bool]:\n", np.arange(nda_bool.size)[nda_bool])  # [0 1]

print("\nnda2[nda_bool]:\n", nda2[nda_bool])  # 二维; 取第0行，第1行，即为True的行
"""
 [[0 1 2 3]
 [4 5 6 7]]
"""
print('\nnda2[mask, 1]：\n', nda2[nda_bool, 1])  # [1 5] 一维; 索引第0,1行, 第1列元素

print("----test---")
print(nda2[:2, ])
